<?php

namespace Database\Seeders;

use App\Page;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $pages = [
            [
                'title' => 'प्रदेश सभा परिचय',
                'descriptions' => "प्रदेश सभा जनताको सार्वभौमसत्ताको प्रयोग गर्ने एक महत्वपूर्ण संस्था हो। शासन प्रणालीमा नीति निर्धारण तथा कानून निर्माण गर्ने जस्तो महत्वपूर्ण कार्य व्यवस्थापन कार्य विधिका माध्यमबाट यसले सुनिश्चित गर्दछ। जनताका प्रतिनिधिको स्वीकृति विना कुनै कर नलगाइने भन्ने सिद्धान्त रहेको र कर सम्बन्धी जनताद्वारा प्रत्यक्ष रुपमा निर्वाचित भई आएका प्रतिनिधिहरु रहेको प्रदेश सभामा प्रस्तुत गर्ने संवैधानिक व्यवस्था गरिएको छ ।
                सुदूरपश्चिम प्रदेशलाई जनसंख्या र भौगोलिक अनुकुलता तथा विशिष्टताका आधारमा बत्तीस निर्वाचन क्षेत्र कायम गरी प्रत्येक निर्वाचन क्षेत्रबाट एक जना रहने गरी पहिलो हुने निर्वाचन प्रणाली बमोजिम निर्वाचित भएका बत्तीस जना र सम्पूर्ण प्रदेशलाई एक निर्वाचन क्षेत्र मानी राजनीतिक दललाई मत दिने समानुपातिक निर्वाचन प्रणाली बमोजिम निर्वाचित भएका उक्काइस जना गरी कुल त्रिपन्न सदस्य रहेको प्रदेश सभा रहेको छ । ",
            ],
        ];
        foreach ($pages as $page) {
            Page::create($page);
        }
    }
}
