@extends('frontend.layouts.app', ['title' => __('गृह')])

@section('content')
    <div class="container">
        <div class="row py-3">
            <div class="col-lg-8">
                <div class="title mb-4">
                    <h5 class="text-theme-color fw-bold">संघीय संसद सचिवालय</h5>
                </div>
                <div class="contents">
                    नेपालको संविधानको धारा १०७ बमोजिम संघीय संसदको काम कारबाही सञ्चालन तथा व्यवस्थापन गर्न संघीय संसद
                    सचिवालय रहेको छ। यस सचिवालयको मुख्य जिम्मेवारी र कार्य संघीय संसद र यसका दुवै सदनका कार्यहरुमा प्रशासकीय
                    सहयोग गर्नु हो। २०७२ असोज ३ गते नेपालको संविधान जारी हुनु अघि संविधानसभाको सचिवालयको रुपमा
                    संविधानसभा/व्यवस्थापिका-संसद सचिवालयको रुपमा स्थापित सचिवालय नै हाल संघीय संसद सचिवालयको रुपमा रहेको छ।
                    संघीय संसद सचिवालय एक प्रशासनिक निकाय हो र सचिवालयलाई सञ्चालन गर्ने प्रयोजनको लागि देहाय बमोजिमको
                    सचिवालय सञ्चालन तथा व्यवस्थापन समिति रहने व्यवस्था संघीय संसद सचिवालय सम्वन्धी ऐन, २०६४ मा रहेको छ: <br>
                    (क) सभामुख – सभापति <br>
                    (ख) राष्ट्रिय सभाको अध्यक्ष – सदस्य <br>
                    (ग) उपसभामुख – सदस्य <br>
                    (घ) राष्ट्रिय सभाको उपाध्यक्ष - सदस्य <br>
                    (ङ) महासचिव – सदस्य <br>
                    (च) प्रतिनिधि सभाको सचिव – सदस्य <br>
                    (छ) राष्ट्रिय सभाको सचिव – सदस्य <br>
                    (ज) सचिवालय सचिव (संसदीय अध्ययन तथा अनुसन्धान) – सदस्य <br>
                    (झ) सचिवालय सचिव (प्रशासन) – सदस्य – सचिव <br> <br>

                    <b>संघीय संसद सचिवालयका मुख्य कार्यहरु</b> <br>
                    सचिवालयको प्रमुख उद्देश्य भन्नु नै संघीय संसदको काम कारवाहीलाई आवश्यक पर्ने प्रशासनिक, व्यवस्थापकीय एवं
                    प्राविधिक सहयोग उपलब्ध गराउनु हो। वुँदागत रुपमा सचिवालयका प्रमुख कार्यहरु देहाय वमोजिमका रहेका छन्ः
                    <ul>
                        <li>संघीय संसद, संघीय संसदका समिति, पदाधिकारी र सदस्यलाई आवश्यक सेवा सुविधा उपलब्ध गराउने।</li>
                        <li>
                            संघीय संसदका कामकारवाही सुचारु रुपले संचालन गर्न प्रशासनिक, आर्थिक र भौतिक व्यवस्थापन सम्वन्धी
                            कार्यलाई
                            व्यवस्थित र प्रभावकारी वनाउने।
                        </li>
                        <li>
                            संघीय संसदका सूचना प्रणालीलाई प्रभावकारी बनाउने तथा संघीय संसद परिसरमा सुरक्षा व्यवस्था मिलाउने।
                        </li>
                        <li>

                            संघीय संसदको संसदीय दलका कार्यालयलाई आवश्यक सेवा सुविधा उपलव्ध गराउने।
                        </li>
                        <li>

                            संघीय संसद, संघीय संसदका समितिहरुका वैठकहरुको व्यवस्थापन गर्ने।
                        </li>
                        <li>
                            नियमित विधायन सम्वन्धी कार्यमा सहयोग पुर्‍याउने तथा संसदीय समितिबाट हुने अनुगमन सम्वन्धी कार्यमा
                            समेत
                            सहयोग पुर्‍याउने।
                        </li>
                    </ul>



                </div>
                <div class="title">
                    <b>संगठनात्मक संरचना</b>
                </div>
            </div>

            <div class="col-lg-4">
                <div class="title mb-4">
                    <h5 class="text-theme-color fw-bold">सचिवालयका शाखाहरु</h5>

                </div>
                <ul style="list-style: none" class="m-0 p-0">
                    @foreach ($departments as $department)
                        <li style="font-size:20px;color:#31709A"> <i style="font-size:18px" class="fa fa-list"></i>
                            <a href="{{route('department.introFront',$department->slug)}}"><span style="color:#31709A">{{$department->name}}</span></a>
                        </li>
                    @endforeach
                </ul>
            </div>
        </div>
        {{-- <x-modal-image-view /> --}}
    @endsection
